genusP/MatterBlinds/config/sdkconfig.defaults.esp32s3
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_esp32s3.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Button and sensor configuration
CONFIG_BUTTON_UP_PIN=4
CONFIG_BUTTON_DOWN_PIN=5
CONFIG_POSITION_SENSOR_POWER_PIN=1
CONFIG_POSITION_SENSOR_ADC_CHANNEL=1
